# https://github.com/Homebrew/homebrew-bundle

brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "git-delta"
brew "htop"
brew "jq"
brew "lazygit"
brew "lynx"
brew "neofetch"
brew "neovim"
brew "ripgrep"
brew "task"
brew "timewarrior"
brew "tldr"
brew "yh"
brew "zellij"
brew "zsh-completions"

{{ if eq .chezmoi.os "darwin" -}}
# BEGINNING macOS only section...
tap "homebrew/cask-fonts"

# casks installed on every macOS machine
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "fork"
cask "wezterm"

{{ if ne .env "utm" -}}
# casks installed only on macOS machines that are not 'utm'
cask "docker"
cask "balenaetcher"
cask "spotify"
cask "tiles"
cask "utm"
{{- end }}

{{ if eq .env "private" -}}
# casks installed only on macOS machines that are 'private'
cask "keepingyouawake"
cask "raspberry-pi-imager"
{{- end }}

{{ end }}